<h2>Pandas</h2>
<h5>It is a python library. It is used for data manipulation, transform, cleaning, preprocessing and analysis.<br><br>Pandas is well-suited for working with tabular data, such as spreadsheets or SQL tables.</h5>

In [3]:
import pandas as pd
import numpy as np
print("Libraries imported")

Libraries imported

<h4>Two primary data structures in pandas are: </h4><h5>(1) Series <br>(2)Dataframe</h5>

<h3>1. Pandas Series</h3>
<h6>A series is a 1D labelled array capable of holding any data type (e.g., integers, strings, float) same like list.</h6>

<h3>2. Dataframe Series</h3>
<h6>It is a two-dimensional data structure with labeled axes (rows and columns).</h6>

In [4]:
# How to create dataframe

dt = {"Name": ["Tanisha", "Shubh", "Shruti"],
      "Branch": ["IT", "CSE", "CSE"],
      "Class": ['A', 'B', 'C'],
      "City": ["Ajmer", "Jaipur", "Agra"]}
dt

{'Name': ['Tanisha', 'Shubh', 'Shruti'],
 'Branch': ['IT', 'CSE', 'CSE'],
 'Class': ['A', 'B', 'C'],
 'City': ['Ajmer', 'Jaipur', 'Agra']}

In [7]:
df = pd.DataFrame(dt)
df

      Name Branch Class    City
0  Tanisha     IT     A   Ajmer
1    Shubh    CSE     B  Jaipur
2   Shruti    CSE     C    Agra

In [8]:
type(df)

pandas.core.frame.DataFrame

In [12]:
# To  take a series from the dataframe
df["Name"]

0    Tanisha
1      Shubh
2     Shruti
Name: Name, dtype: object

In [13]:
type(df["Name"])

pandas.core.series.Series

In [15]:
df.dtypes

Name      object
Branch    object
Class     object
City      object
dtype: object

In [16]:
df.shape

(3, 4)

In [23]:
df[["Name", "Class"]]

      Name Class
0  Tanisha     A
1    Shubh     B
2   Shruti     C